In [1]:
import pandas as pd
import numpy as np

In [5]:
vals1 = np.array([1, None, 3,4])
vals1

array([1, None, 3, 4], dtype=object)

In [3]:
for dtype in ['object', 'int']:
    print("dtype=", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype= object
71.8 ms ± 600 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype= int
1.7 ms ± 14.1 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [6]:
vals2 = np.array([1, np.nan,3,4])
vals2.dtype

dtype('float64')

In [7]:
vals2.sum(), vals2.min()

(nan, nan)

In [10]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [11]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [12]:
x =pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [14]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [15]:
data = pd.Series([1, np.nan, 'hello', None])

In [16]:
#detecting null values
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [17]:
#returning the none null values
data[data.notnull()]

0        1
2    hello
dtype: object

In [18]:
#dropping null values
data.dropna()

0        1
2    hello
dtype: object

In [21]:
#dropping nulls in a dataframe
df = pd.DataFrame([[1, np.nan, 2],
                 [2,   3,     5],
                 [np.nan, 4,   6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [22]:
#drops all rows containing null values
df.dropna()

     0    1  2
1  2.0  3.0  5

In [23]:
#drops columns containing null values
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [24]:
df[3] =np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [26]:
#how='all' drops all rows and colums that are all null values
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [31]:
#thresh helps you specify a minimum number of non-null values for the
#row/column to be kept
df.dropna(axis='rows', thresh =3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [33]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [34]:
#filling none null values
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [35]:
#forward fill propagate
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [36]:
#back-fill propagate
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [37]:
#for a df
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [43]:
#axis=1 same as axis='columns'?
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0